In [1]:
# Import Necessar Libraries
from pyspark.sql import SparkSession
from pyspark.sql import DataFrameWriter
from pyspark.sql.functions import monotonically_increasing_id
import os
import psycopg2

In [2]:
# Set Java Home
os.environ['JAVA_HOME'] = 'C:\java8'

In [3]:
# Initialized my Spark Session
spark = SparkSession.builder \
        .appName("Nuga Bank ETL") \
        .config("spark.jars", "postgresql-42.7.3.jar") \
        .getOrCreate()

In [4]:
spark

In [5]:
# Extract this Historical data into a spark dataframe
df = spark.read.csv(r'dataset\rawdata\nuga_bank_transactions.csv', header=True, inferSchema=True)

In [6]:
df.show(5)

+--------------------+------+----------------+--------------+--------------------+------------------+--------------+--------------------+--------------------+--------------------+--------------------+-------------------+------------------+--------------------+-------------+-------------+--------+-----+---------+--------------------+--------------------+------+--------------+
|    Transaction_Date|Amount|Transaction_Type| Customer_Name|    Customer_Address|     Customer_City|Customer_State|    Customer_Country|             Company|           Job_Title|               Email|       Phone_Number|Credit_Card_Number|                IBAN|Currency_Code|Random_Number|Category|Group|Is_Active|        Last_Updated|         Description|Gender|Marital_Status|
+--------------------+------+----------------+--------------+--------------------+------------------+--------------+--------------------+--------------------+--------------------+--------------------+-------------------+------------------+--------------------+-------------+-------------+--------+-----+---------+--------------------+--------------------+------+--------------+
|2024-03-23 15:38:...| 34.76|      Withdrawal|    James Neal|54912 Holmes Lodg...| West Keithborough|       Florida|                Togo|Benson, Johnson a...|                NULL|                NULL|  493.720.6609x7545|  3592901394693441|GB98RBPP090285271...|          MAD|       3167.0|       C|    Z|       No|2020-06-20 03:04:...|Yeah food anythin...| Other|      Divorced|
|2024-04-22 19:15:...|163.92|      Withdrawal|   Thomas Long| 1133 Collin Passage|        Joshuabury|   Connecticut|Lao People's Demo...|                NULL|   Food technologist|michellelynch@exa...|      (497)554-3317|              NULL|GB03KFZR339662263...|          VEF|       2122.0|       B|    Z|     NULL|2020-12-27 13:23:...|Teach edge make n...|Female|       Married|
|2024-04-12 19:46:...|386.32|      Withdrawal|Ashley Shelton|5297 Johnson Port...|       North Maria|    New Jersey|              Bhutan|       Jones-Mueller|Database administ...| ljordan@example.org|      (534)769-3072|      675983949974|GB59QYRN446730519...|          COP|       7796.0|       C|    Z|       No|2020-01-24 01:23:...|Again line face c...| Other|          NULL|
|2024-04-17 15:29:...|407.15|         Deposit| James Rosario|56955 Moore Glens...|North Michellefurt|    New Mexico|             Iceland|       Vargas-Harris|Horticultural the...|parkerjames@examp...|+1-447-900-1320x257|     4761202519057|GB74FTDO268299438...|          BWP|       6284.0|       C|    Z|      Yes|2023-09-27 03:01:...|     Bag my a drive.|  NULL|          NULL|
|2024-02-10 01:51:...|161.31|         Deposit|Miguel Leonard|262 Beck Expressw...|              NULL| West Virginia|             Eritrea|Richardson, Gonza...|   Minerals surveyor| zweaver@example.net|               NULL|   213156729655186|GB94EWRN587847592...|          SOS|       9179.0|       C|    Y|       No|2022-01-22 19:08:...|Husband find ok w...|Female|       Married|
+--------------------+------+----------------+--------------+--------------------+------------------+--------------+--------------------+--------------------+--------------------+--------------------+-------------------+------------------+--------------------+-------------+-------------+--------+-----+---------+--------------------+--------------------+------+--------------+
only showing top 5 rows

In [7]:
df.printSchema()

root
 |-- Transaction_Date: timestamp (nullable = true)
 |-- Amount: double (nullable = true)
 |-- Transaction_Type: string (nullable = true)
 |-- Customer_Name: string (nullable = true)
 |-- Customer_Address: string (nullable = true)
 |-- Customer_City: string (nullable = true)
 |-- Customer_State: string (nullable = true)
 |-- Customer_Country: string (nullable = true)
 |-- Company: string (nullable = true)
 |-- Job_Title: string (nullable = true)
 |-- Email: string (nullable = true)
 |-- Phone_Number: string (nullable = true)
 |-- Credit_Card_Number: long (nullable = true)
 |-- IBAN: string (nullable = true)
 |-- Currency_Code: string (nullable = true)
 |-- Random_Number: double (nullable = true)
 |-- Category: string (nullable = true)
 |-- Group: string (nullable = true)
 |-- Is_Active: string (nullable = true)
 |-- Last_Updated: timestamp (nullable = true)
 |-- Description: string (nullable = true)
 |-- Gender: string (nullable = true)
 |-- Marital_Status: string (nullable = true)

In [8]:
# Data Cleaning and Transformation
for column in df.columns:
    print(column, 'Nulls: ', df.filter(df[column].isNull()).count())

Transaction_Date Nulls:  0
Amount Nulls:  0
Transaction_Type Nulls:  0
Customer_Name Nulls:  100425
Customer_Address Nulls:  100087
Customer_City Nulls:  100034
Customer_State Nulls:  100009
Customer_Country Nulls:  100672
Company Nulls:  100295
Job_Title Nulls:  99924
Email Nulls:  100043
Phone_Number Nulls:  100524
Credit_Card_Number Nulls:  100085
IBAN Nulls:  100300
Currency_Code Nulls:  99342
Random_Number Nulls:  99913
Category Nulls:  100332
Group Nulls:  100209
Is_Active Nulls:  100259
Last_Updated Nulls:  100321
Description Nulls:  100403
Gender Nulls:  99767
Marital_Status Nulls:  99904

In [9]:
df.describe().show()

+-------+------------------+----------------+-------------+--------------------+-------------+--------------+----------------+-------------+------------------+-------------------+--------------------+--------------------+--------------------+-------------+------------------+--------+------+---------+--------------------+------+--------------+
|summary|            Amount|Transaction_Type|Customer_Name|    Customer_Address|Customer_City|Customer_State|Customer_Country|      Company|         Job_Title|              Email|        Phone_Number|  Credit_Card_Number|                IBAN|Currency_Code|     Random_Number|Category| Group|Is_Active|         Description|Gender|Marital_Status|
+-------+------------------+----------------+-------------+--------------------+-------------+--------------+----------------+-------------+------------------+-------------------+--------------------+--------------------+--------------------+-------------+------------------+--------+------+---------+--------------------+------+--------------+
|  count|           1000000|         1000000|       899575|              899913|       899966|        899991|          899328|       899705|            900076|             899957|              899476|              899915|              899700|       900658|            900087|  899668|899791|   899741|              899597|900233|        900096|
|   mean|504.97371121999953|            NULL|         NULL|                NULL|         NULL|          NULL|            NULL|         NULL|              NULL|               NULL|  6.00341888622502E9|3.785330130644817...|                NULL|         NULL| 5504.445295843624|    NULL|  NULL|     NULL|                NULL|  NULL|          NULL|
| stddev| 285.7997202441231|            NULL|         NULL|                NULL|         NULL|          NULL|            NULL|         NULL|              NULL|               NULL|2.3071119812223907E9|1.247765855631420...|                NULL|         NULL|2598.1680843741146|    NULL|  NULL|     NULL|                NULL|  NULL|          NULL|
|    min|              10.0|         Deposit| Aaron Abbott|000 Aaron Landing...|    Aaronberg|       Alabama|     Afghanistan| Abbott Group|Academic librarian|aabbott@example.com|       (200)201-4254|         60400015693|GB02AAAU191993009...|          AED|            1000.0|       A|     X|       No|A American and to...|Female|      Divorced|
|    max|            1000.0|      Withdrawal|    Zoe Young|    99999 Mark Vista|  Zunigaville|       Wyoming|        Zimbabwe|Zuniga-Wilson|      Youth worker|zzuniga@example.org|          9999777682| 4999984361512569455|GB98ZZXM257326775...|          ZWD|            9999.0|       D|     Z|      Yes|Yourself young ev...| Other|        Single|
+-------+------------------+----------------+-------------+--------------------+-------------+--------------+----------------+-------------+------------------+-------------------+--------------------+--------------------+--------------------+-------------+------------------+--------+------+---------+--------------------+------+--------------+

In [10]:
df_clean = df.fillna({
    'Customer_Name': 'Unknown',
    'Customer_Address': 'Unknown',
    'Customer_City' : 'Unknown',
    'Customer_State' : 'Unknown',
    'Customer_Country' : 'Unknown',
    'Company' : 'Unknown',
    'Job_Title' : 'Unknown',
    'Email' : 'Unknown',
    'Phone_Number' : 'Unknown',
    'Credit_Card_Number' : 0,
    'IBAN' : 'Unknown',
    'Currency_Code' : 'Unknown',
    'Random_Number' : 0.0,
    'Category' : 'Unknown',
    'Group' : 'Unknown',
    'Is_Active' : 'Unknown',
    'Description' : 'Unknown',
    'Gender' : 'Unknown',
    'Marital_Status' : 'Unknown'
})

In [11]:
# drop the missing values in the Last_Updated column
df_clean = df_clean.na.drop(subset=['Last_Updated'])

In [12]:
# Data cleaning and transformation\n",
for column in df_clean.columns:
    print(column, 'Nulls: ', df_clean.filter(df_clean[column].isNull()).count())

Transaction_Date Nulls:  0
Amount Nulls:  0
Transaction_Type Nulls:  0
Customer_Name Nulls:  0
Customer_Address Nulls:  0
Customer_City Nulls:  0
Customer_State Nulls:  0
Customer_Country Nulls:  0
Company Nulls:  0
Job_Title Nulls:  0
Email Nulls:  0
Phone_Number Nulls:  0
Credit_Card_Number Nulls:  0
IBAN Nulls:  0
Currency_Code Nulls:  0
Random_Number Nulls:  0
Category Nulls:  0
Group Nulls:  0
Is_Active Nulls:  0
Last_Updated Nulls:  0
Description Nulls:  0
Gender Nulls:  0
Marital_Status Nulls:  0

In [14]:
# Data Transformation to 2NF
# transaction table
transaction = df_clean.select('Transaction_Date', 'Amount', 'Transaction_Type') \
                    .withColumn('transaction_id', monotonically_increasing_id()) \
                    .select('transaction_id', 'Transaction_Date', 'Amount', 'Transaction_Type')

In [15]:
transaction.show(5)

+--------------+--------------------+------+----------------+
|transaction_id|    Transaction_Date|Amount|Transaction_Type|
+--------------+--------------------+------+----------------+
|             0|2024-03-23 15:38:...| 34.76|      Withdrawal|
|             1|2024-04-22 19:15:...|163.92|      Withdrawal|
|             2|2024-04-12 19:46:...|386.32|      Withdrawal|
|             3|2024-04-17 15:29:...|407.15|         Deposit|
|             4|2024-02-10 01:51:...|161.31|         Deposit|
+--------------+--------------------+------+----------------+
only showing top 5 rows

In [16]:
# customer table
customer = df_clean.select('Customer_Name', 'Customer_Address', 'Customer_City', \
                        'Customer_State', 'Customer_Country') \
                .withColumn('customer_id', monotonically_increasing_id()) \
                .select('customer_id', 'Customer_Name', 'Customer_Address', 'Customer_City', \
                        'Customer_State', 'Customer_Country')

In [17]:
customer.show(5)

+-----------+--------------+--------------------+------------------+--------------+--------------------+
|customer_id| Customer_Name|    Customer_Address|     Customer_City|Customer_State|    Customer_Country|
+-----------+--------------+--------------------+------------------+--------------+--------------------+
|          0|    James Neal|54912 Holmes Lodg...| West Keithborough|       Florida|                Togo|
|          1|   Thomas Long| 1133 Collin Passage|        Joshuabury|   Connecticut|Lao People's Demo...|
|          2|Ashley Shelton|5297 Johnson Port...|       North Maria|    New Jersey|              Bhutan|
|          3| James Rosario|56955 Moore Glens...|North Michellefurt|    New Mexico|             Iceland|
|          4|Miguel Leonard|262 Beck Expressw...|           Unknown| West Virginia|             Eritrea|
+-----------+--------------+--------------------+------------------+--------------+--------------------+
only showing top 5 rows

In [18]:
# employee table
employee = df_clean.select('Company', 'Job_Title', 'Email', 'Phone_Number', \
                           'Gender', 'Marital_Status') \
                        .withColumn('employee_id', monotonically_increasing_id()) \
                        .select('employee_id', 'Company', 'Job_Title', 'Email', 'Phone_Number', \
                            'Gender', 'Marital_Status')

In [19]:
employee.show()

+-----------+--------------------+--------------------+--------------------+-------------------+-------+--------------+
|employee_id|             Company|           Job_Title|               Email|       Phone_Number| Gender|Marital_Status|
+-----------+--------------------+--------------------+--------------------+-------------------+-------+--------------+
|          0|Benson, Johnson a...|             Unknown|             Unknown|  493.720.6609x7545|  Other|      Divorced|
|          1|             Unknown|   Food technologist|michellelynch@exa...|      (497)554-3317| Female|       Married|
|          2|       Jones-Mueller|Database administ...| ljordan@example.org|      (534)769-3072|  Other|       Unknown|
|          3|       Vargas-Harris|Horticultural the...|parkerjames@examp...|+1-447-900-1320x257|Unknown|       Unknown|
|          4|Richardson, Gonza...|   Minerals surveyor| zweaver@example.net|            Unknown| Female|       Married|
|          5|           Smith Ltd| Seismic interpreter|benjaminwalker@ex...|   229-511-2530x870|  Other|       Married|
|          6|         Wade-Kelley|  Surveyor, minerals|karenrobinson@exa...|      (840)334-1610|   Male|       Unknown|
|          7|             Unknown|Medical laborator...|  iestes@example.org| 495.430.4276x42618| Female|        Single|
|          8|         Lindsey LLC|Programmer, appli...|maryduran@example...|  (241)738-0972x658| Female|        Single|
|          9|         Carroll LLC|             Unknown|             Unknown|       670-499-0309|   Male|        Single|
|         10|             Unknown|     Sales executive|  eric64@example.net|            Unknown|   Male|      Divorced|
|         11|Lynch, Hayes and ...|       Stage manager|stewartjames@exam...|  680-460-3674x6031|Unknown|       Married|
|         12|           Green Ltd|Psychologist, pri...|             Unknown|       695-680-5744|   Male|       Unknown|
|         13|             Unknown|Designer, blown g...|  mark84@example.com| 484.837.6166x81262| Female|        Single|
|         14|     Morris-Reynolds|          Podiatrist|robert02@example.com| 623.219.7997x39012|  Other|       Married|
|         15|         Sutton-Owen|   Financial planner|ewilliams@example...|            Unknown|  Other|       Married|
|         16|         Brown Group|Nutritional thera...|suzanne41@example...|       448-821-0207|  Other|       Married|
|         17|         Scott Group|     Games developer|sullivandiane@exa...|(643)844-2202x42284|  Other|       Married|
|         18|Bryant, Huffman a...|Research scientis...|elliserica@exampl...|   214-650-4477x630|  Other|       Married|
|         19|          Palmer PLC|             Unknown|annerice@example.com|  (528)927-0111x373|   Male|      Divorced|
+-----------+--------------------+--------------------+--------------------+-------------------+-------+--------------+
only showing top 20 rows

In [20]:
# fact table
fact_table = df_clean.join(transaction, ['Transaction_Date', 'Amount', 'Transaction_Type'], 'inner') \
                    .join(customer, ['Customer_Name', 'Customer_Address', 'Customer_City', \
                                     'Customer_State', 'Customer_Country'], 'inner') \
                    .join(employee, ['Company', 'Job_Title', 'Email', 'Phone_Number', \
                                     'Gender', 'Marital_Status'], 'inner') \
                    .select('transaction_id', 'customer_id', 'employee_id', 'Credit_Card_Number',\
                                     'IBAN', 'Currency_Code', 'Random_Number','Category', 'Group', \
                                     'Is_Active', 'Last_Updated', 'Description')

In [21]:
fact_table.show(5)

+--------------+-----------+-----------+-------------------+--------------------+-------------+-------------+--------+-------+---------+--------------------+--------------------+
|transaction_id|customer_id|employee_id| Credit_Card_Number|                IBAN|Currency_Code|Random_Number|Category|  Group|Is_Active|        Last_Updated|         Description|
+--------------+-----------+-----------+-------------------+--------------------+-------------+-------------+--------+-------+---------+--------------------+--------------------+
|   17179987341|17179987341|17179987341|     30233184463165|GB82ZFSS908131813...|          PAB|       6515.0|       B|Unknown|      Yes|2021-12-12 16:34:...|Without shake mom...|
|    8589986604| 8589986604| 8589986604|4131053293826613966|GB78CKOS832138470...|          GNF|       7475.0|       B|      Z|      Yes|2022-02-06 23:35:...|Health sure story...|
|         29992|      29992|      29992|   2452924189738024|GB50ZGVC717046003...|          TRY|       9153.0|       D|      Z|       No|2021-11-26 08:47:...|Wait represent ge...|
|    8590085798| 8590085798| 8590085798|   4625846628264239|GB97NDWP370396356...|          BSD|       6117.0| Unknown|      X|      Yes|2023-02-14 08:41:...|Onto give past no...|
|   25770002257|25770002257|25770002257|                  0|GB11VVRM027865406...|      Unknown|       6669.0|       C|      X|       No|2022-04-13 17:22:...|Teach military ev...|
+--------------+-----------+-----------+-------------------+--------------------+-------------+-------------+--------+-------+---------+--------------------+--------------------+
only showing top 5 rows

In [30]:
# Develop Functions to Get Database Connection\n",
def get_db_connection():
    connection = psycopg2.connect(
        host='localhost',
        database='nuga_bank_etl',
        user='postgres',
        password='Melacholy201)'
    )
    return connection

# Connect to SQL Database
conn = get_db_connection()

In [31]:
# Create a function to create tables
def create_table():
    conn = get_db_connection()
    cursor = conn.cursor()
    create_table_query = '''
                            DROP TABLE IF EXISTS customer;
                            DROP TABLE IF EXISTS transaction;
                            DROP TABLE IF EXISTS employee;
                            DROP TABLE IF EXISTS fact_table;

                            CREATE TABLE customer (
                                customer_id BIGINT,
                                Customer_Name VARCHAR(10000),
                                Customer_Address VARCHAR(10000),
                                Customer_City VARCHAR(10000),
                                Customer_State VARCHAR(10000),
                                Customer_Country VARCHAR(10000)
                            );

                            CREATE TABLE transaction (
                                transaction_id BIGINT,
                                Transaction_Date DATE,
                                Amount FLOAT,
                                Transaction_Type VARCHAR(10000)
                            );

                            CREATE TABLE employee (
                                employee_id BIGINT,
                                Company VARCHAR(10000),
                                Job_Title VARCHAR(10000),
                                Email VARCHAR(10000),
                                Phone_Number VARCHAR(10000),
                                Gender VARCHAR(10000),
                                Marital_Status VARCHAR(10000)
                            );

                            CREATE TABLE fact_table (
                                transaction_id BIGINT,
                                customer_id BIGINT,
                                employee_id BIGINT,
                                Credit_Card_Number BIGINT,
                                IBAN VARCHAR(10000),
                                Currency_Code VARCHAR(10000),
                                Random_Number FLOAT,
                                Category VARCHAR(10000),
                                "Group" VARCHAR(10000),
                                Is_Active VARCHAR(10000),
                                Last_Updated DATE,
                                Description VARCHAR(10000)
                            );
                            '''

    cursor.execute(create_table_query)
    conn.commit()
    cursor.close()
    conn.close()

In [32]:
create_table()

In [33]:
url = "jdbc:postgresql://localhost:5432/nuga_bank_etl"
properties = {
    "user" : "postgres",
    "password" : "Melacholy201)",
    "driver" : "org.postgresql.Driver"
}

customer.write.jdbc(url=url, table="customer", mode="append", properties=properties)

In [34]:
employee.write.jdbc(url=url, table="employee", mode="append", properties=properties)
transaction.write.jdbc(url=url, table="transaction", mode="append", properties=properties)
fact_table.write.jdbc(url=url, table="fact_table", mode="append", properties=properties)